fall2017/psyc3330/lectures/week12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Week 12 lecture notes - PSYC 3330</title>
<!-- 2017-11-13 Mon 09:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Week 12 lecture notes - PSYC 3330</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The Chi-Square Test for Goodness of Fit</h2>
<div class="outline-text-2" id="text-1">
<p>
This week, we will talk about hypothesis testing for situations where the dependent variable is a <b>count</b> or a <b>proportion</b>, neither of which can be described as as normal distribution.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Example 1</h2>
<div class="outline-text-2" id="text-2">
<p>
A researcher presented \(n=50\) participants with an abstract painting (with no obvious top/bottom) and asked each participant to hang the painting in the orientation that looked correct.  The data are below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Top up</th>
<th scope="col" class="right">Bottom up</th>
<th scope="col" class="right">Left side up</th>
<th scope="col" class="right">Right side up</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">18</td>
<td class="right">17</td>
<td class="right">7</td>
<td class="right">8</td>
</tr>
</tbody>
</table>

<p>
Is there any preference among the four options?  That is, are any of the orientations selected more often than would be expected by chance alone?
</p>

<p>
Step 1 - state null hypothesis
</p>

<p>
If there were NO preference, the proportions in each category would be equivalent.  Thus the null hypothesis would be that the expected count in each category would be 1/4 (25%) of the sample (that is, a <i>uniform</i> distribution of counts):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Top up</th>
<th scope="col" class="right">Bottom up</th>
<th scope="col" class="right">Left side up</th>
<th scope="col" class="right">Right side up</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">25%</td>
<td class="right">25%</td>
<td class="right">25%</td>
<td class="right">25%</td>
</tr>

<tr>
<td class="right">12.5</td>
<td class="right">12.5</td>
<td class="right">12.5</td>
<td class="right">12.5</td>
</tr>
</tbody>
</table>

<p>
So, the technical definitions would be:
</p>

<ul class="org-ul">
<li>\(H_0\): all options are selected equally often
</li>
<li>\(H_1\): some options are selected more often than others
</li>
</ul>

<p>
As usual, we will use \(\alpha=0.05\).
</p>

<p>
Step 2 - the Chi-Square statistic
</p>

<p>
In developing a statistic, we need something that will index how far away our distribution of counts is from a uniform distribution of counts.  That statistic is the <i>Chi-square</i> statistic:
</p>

<p>
\[
\chi^2 = \sum \frac{(f_o-f_e)^2}{f_e}
\]
</p>

<p>
where:
</p>
<ul class="org-ul">
<li>f<sub>o</sub> = observed count
</li>
<li>f<sub>e</sub> = expected count
</li>
</ul>

<p>
As usual, this statistic has a table of critical values in the back of your textbook.  The table is based on \(\alpha\) and \(df\), which in this case represents the number of categories minus one.
</p>

<p>
So, based on our null hypothesis (with \(df=3\)) and choosing \(\alpha=0.05\), we have \(\chi^2_{\text{crit}}=7.81\).
</p>

<p>
Now, lets compute \(\chi^2\):
</p>

\begin{align*}
\chi^2 &= \sum \frac{(f_o-f_e)^2}{f_e}\\
&= \frac{(18-12.5)^2}{12.5} + \frac{(17-12.5)^2}{12.5} + \frac{(7-12.5)^2}{12.5} + \frac{(8-12.5)^2}{12.5}\\
&= \frac{30.25}{12.5} + \frac{20.25}{12.5} + \frac{30.25}{12.5} + \frac{20.25}{12.5}\\
&= 2.42 + 1.62 + 2.42 + 1.62\\
&= 8.08
\end{align*}

<p>
Since \(\chi^2_{\text{sample}} = 8.08\), which exceeds \(\chi^2_{\text{crit}}\), we reject the null and conclude that some of the options are selected more frequently than others.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Example 2</h2>
<div class="outline-text-2" id="text-3">
<p>
A researcher is interested in pizza preference. A sample of \(n=45\) students is obtained and fresh pizza is ordered from each of 3 shops in town. Each student tastes all three pizzas and then selects a favorite. The observed frequencies are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Shop A</th>
<th scope="col" class="right">Shop B</th>
<th scope="col" class="right">Shop C</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">13</td>
<td class="right">24</td>
<td class="right">8</td>
</tr>
</tbody>
</table>

<p>
Is there a preference for one or more shops that exceeds chance?
</p>

<p>
Step 1: define null hypothesis
</p>

<ul class="org-ul">
<li>\(H_0\): each shop is chosen equally often
</li>
<li>\(H_1\): one or more shops is selected more often than the others
</li>
</ul>

<p>
If we choose \(\alpha=0.05\), and we have \(df=2\), we note from the table that \(\chi^2_{\text{crit}}= 5.99\).
</p>

<p>
Step 2: compute \(\chi^2\) statistic
</p>

<p>
Note that \(f_e=15\) for each category.  Thus, we have 
</p>

\begin{align*}
\chi^2_{\text{samp}} &= \sum \frac{(f_o-f_e)^2}{f_e} \\
&= \frac{(13-15)^2}{15} + \frac{(24-15)^2}{15} + \frac{(8-15)^2}{15}\\
&= \frac{4}{15} + \frac{81}{15} + \frac{49}{15}\\
&= 0.267 + 5.4 + 3.267\\
&= 8.93\\
\end{align*}

<p>
Since \(\chi^2_{\text{samp}}=8.93\) which exceeds \(\chi^2_{\text{crit}}\), we reject \(H_0\) and conclude that there is a preference among the three options.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Nov 13-17, 2017</p>
<p class="date">Created: 2017-11-13 Mon 09:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
